<a href="https://colab.research.google.com/github/arehvs/practice/blob/main/practice01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
# Players Dhoni, Raina, Rithu
# Rus 50, 48, 88

In [ ]:
pd.DataFrame({'players':['Dhoni', 'Raina', 'Rithu'],'runs':[50,48,88]})

  players  runs
0   Dhoni    50
1   Raina    48
2   Rithu    88

In [ ]:
pd.DataFrame({'players':['Dhoni', 'Raina', 'Rithu'],'runs':[50,48,88],'balls':[25,13,58]})

  players  runs  balls
0   Dhoni    50     25
1   Raina    48     13
2   Rithu    88     58

In [ ]:
# creating data frame
df = pd.DataFrame({'players':['Dhoni', 'Raina', 'Rithu'],'runs':[50,48,88],'balls':[25,13,58]})

In [ ]:
df

  players  runs  balls
0   Dhoni    50     25
1   Raina    48     13
2   Rithu    88     58

In [ ]:
# Listing players
df['players']

0    Dhoni
1    Raina
2    Rithu
Name: players, dtype: object

In [ ]:
# Listing players and runs
df[['players','runs']]

  players  runs
0   Dhoni    50
1   Raina    48
2   Rithu    88

In [ ]:
const_list1 = ['players','runs']
const_list2 = ['runs','balls']

In [ ]:
df[const_list1]

  players  runs
0   Dhoni    50
1   Raina    48
2   Rithu    88

In [ ]:
df[const_list2]

   runs  balls
0    50     25
1    48     13
2    88     58

In [ ]:
# Listing details based on the index
df['players'][2]

'Rithu'

In [ ]:
type(df.players)

pandas.core.series.Series

In [ ]:
list(df.players)[2]

'Rithu'

In [ ]:
df.iloc[1:2]

  players  runs  balls
1   Raina    48     13

In [ ]:
df[df['players'] == 'Dhoni']

  players  runs  balls
0   Dhoni    50     25

In [ ]:
df[['players','runs','balls']]

  players  runs  balls
0   Dhoni    50     25
1   Raina    48     13
2   Rithu    88     58

In [ ]:
for columnName in df:
  print(columnName)
  print(df[columnName])

players
0    Dhoni
1    Raina
2    Rithu
Name: players, dtype: object
runs
0    50
1    48
2    88
Name: runs, dtype: int64
balls
0    25
1    13
2    58
Name: balls, dtype: int64

In [ ]:
for columnName,item in df.iteritems():
  print(type(columnName))
  print(columnName)
  print('-----------------------')
  print(type(item))
  print(item)

<class 'str'>
players
-----------------------
<class 'pandas.core.series.Series'>
0    Dhoni
1    Raina
2    Rithu
Name: players, dtype: object
<class 'str'>
runs
-----------------------
<class 'pandas.core.series.Series'>
0    50
1    48
2    88
Name: runs, dtype: int64
<class 'str'>
balls
-----------------------
<class 'pandas.core.series.Series'>
0    25
1    13
2    58
Name: balls, dtype: int64

In [ ]:
df["strik_rate"] = 100* df['runs']/df['balls']

In [ ]:
df

  players  runs  balls  strik_rate
0   Dhoni    50     25  200.000000
1   Raina    48     13  369.230769
2   Rithu    88     58  151.724138

In [ ]:
# df['fours'][1] = 5
# df['sixes'][1] = 3

In [ ]:
df

  players  runs  balls  strik_rate  fours  sixes
0   Dhoni    50     25  200.000000      3      4
1   Raina    48     13  369.230769      3      4
2   Rithu    88     58  151.724138      3      4

In [ ]:
# df.fours[2] = 9
# df.sixes[2] = 4

In [ ]:
df['percentBoundary'] = 100* (df['fours'] * 4 + df['sixes'] * 6) /(df['runs'])

In [ ]:
df

  players  runs  balls  strik_rate  fours  sixes  percentBoundary
0   Dhoni    50     25  200.000000      3      4        72.000000
1   Raina    48     13  369.230769      5      3        79.166667
2   Rithu    88     58  151.724138      9      4        68.181818

In [ ]:
+